---
kind: method
id: M:Autodesk.Revit.DB.View.GetReferenceSections
zh: 视图
source: html/8ea511ab-7bca-bb8b-4eb0-1c1bacfc03f7.htm
---
# Autodesk.Revit.DB.View.GetReferenceSections Method

**中文**: 视图

Returns element ids of all reference sections in the view.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetReferenceSections()
```

## Returns
Element ids of all reference sections in the view.